<!-- placeholder-1 -->
```fish
terraform plan -chdir=. -refresh=true
```
<!-- placeholder-2 -->

<!-- placeholder-3 -->
<details><summary>Plan: 3 to add, 0 to change, 4 to destroy.</br>

<!-- placeholder-4 -->
###### By @b- at 2025-08-15T00:56:46Z [(view log)](https://github.com/perchnet/p/actions/runs/16980246472/job/48138525758#step:11:1).
</summary>

```hcl

Error: Invalid function argument

  on .terraform/modules/debian13/modules/image/variables.tf line 44, in variable "image_content_type":
  44:     condition     = contains(["iso", "vztmpl"], var.image_content_type)
    ├────────────────
    │ while calling contains(list, value)
    │ var.image_content_type is null

Invalid value for "value" parameter: argument must not be null.

Error: Invalid template interpolation value

  on .terraform/modules/debian13/modules/image/variables.tf line 45, in variable "image_content_type":
  45:     error_message = "Invalid content type: ${var.image_content_type}."
    ├────────────────
    │ var.image_content_type is null

The expression result is null. Cannot include a null value in a string
template.

Error: Invalid function argument

  on .terraform/modules/ubuntu22/modules/image/variables.tf line 44, in variable "image_content_type":
  44:     condition     = contains(["iso", "vztmpl"], var.image_content_type)
    ├────────────────
    │ while calling contains(list, value)
    │ var.image_content_type is null

Invalid value for "value" parameter: argument must not be null.

Error: Invalid template interpolation value

  on .terraform/modules/ubuntu22/modules/image/variables.tf line 45, in variable "image_content_type":
  45:     error_message = "Invalid content type: ${var.image_content_type}."
    ├────────────────
    │ var.image_content_type is null

The expression result is null. Cannot include a null value in a string
template.
laxjicxo3e/items/cvh7gepgwlnb7yxtkxsvlsokti]
data.onepassword_item.github_infra_app: Read complete after 1s [id=vaults/xjvmoejfpwbuvwpelaxjicxo3e/items/bfyitfe53xaaelfs2kz73nbreq]
data.onepassword_item.proxmox_ssh: Read complete after 1s [id=vaults/xjvmoejfpwbuvwpelaxjicxo3e/items/7sa3h66bvyxryglelfxsruzzhu]
tailscale_tailnet_key.tailscale_key: Refreshing state... [id=kgxxzsWVRL11CNTRL]
module.pkcs8_to_pem.data.external.pkcs8_to_pem: Reading...
github_repository.p_repository: Refreshing state... [id=p]
github_repository_ruleset.p_merge_queue: Refreshing state... [id=6621869]
module.pkcs8_to_pem.data.external.pkcs8_to_pem: Read complete after 1s [id=-]
module.proxmox_images.proxmox_virtual_environment_download_file.images["ubuntu_noble_cloud_image"]: Refreshing state... [id=zssd-files:iso/TFimg_ubuntu-24-9a7f.04-cloudimg-amd64.qcow.img]
module.proxmox_images.proxmox_virtual_environment_download_file.images["debian_trixie"]: Refreshing state... [id=zssd-files:iso/TFimg_debian-13-genericcloud-amd64-a110.qcow2.img]
module.proxmox_images.proxmox_virtual_environment_download_file.images["ubuntu_jammy"]: Refreshing state... [id=zssd-files:iso/TFimg_ubuntu-22-d4a5.04-server-cloudimg-amd64.qcow.img]
module.proxmox_images.proxmox_virtual_environment_download_file.images["debian_bookworm"]: Refreshing state... [id=zssd-files:iso/TFimg_debian-12-nocloud-amd64-2fbe.qcow2.img]
module.proxmox_images.proxmox_virtual_environment_download_file.images["coreos_img"]: Refreshing state... [id=zssd-files:iso/TFimg_fedora-coreos-42-5160.20250803.2.0-proxmoxve.x86_64.qcow2.xz.img]
module.debian13.proxmox_virtual_environment_vm.vm_template: Refreshing state... [id=9013]
module.ubuntu22.proxmox_virtual_environment_vm.vm_template: Refreshing state... [id=8022]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform planned the following actions, but then encountered a problem:

  # tailscale_tailnet_key.tailscale_key will be created
  + resource "tailscale_tailnet_key" "tailscale_key" {
      + created_at    = (known after apply)
      + ephemeral     = false
      + expires_at    = (known after apply)
      + expiry        = 600
      + id            = (known after apply)
      + invalid       = (known after apply)
      + key           = (sensitive value)
      + preauthorized = true
      + reusable      = true
      + tags          = [
          + "tag:web-ingress",
        ]
      + user_id       = (known after apply)
    }

  # module.debian13.proxmox_virtual_environment_vm.vm_template will be destroyed
  # (because proxmox_virtual_environment_vm.vm_template is not in configuration)
  - resource "proxmox_virtual_environment_vm" "vm_template" {
      - acpi                    = true -> null
      - bios                    = "seabios" -> null
      - id                      = "9013" -> null
      - ipv4_addresses          = [] -> null
      - ipv6_addresses          = [] -> null
      - keyboard_layout         = "en-us" -> null
      - mac_addresses           = [] -> null
      - machine                 = "q35" -> null
      - migrate                 = false -> null
      - name                    = "debian13" -> null
      - network_interface_names = [] -> null
      - node_name               = "pve1" -> null
      - on_boot                 = true -> null
      - protection              = false -> null
      - reboot                  = false -> null
      - reboot_after_update     = true -> null
      - scsi_hardware           = "virtio-scsi-pci" -> null
      - stop_on_destroy         = false -> null
      - tablet_device           = true -> null
      - tags                    = [
          - "debian",
          - "template",
          - "terraform",
        ] -> null
      - template                = true -> null
      - timeout_clone           = 1800 -> null
      - timeout_create          = 1800 -> null
      - timeout_migrate         = 1800 -> null
      - timeout_move_disk       = 1800 -> null
      - timeout_reboot          = 1800 -> null
      - timeout_shutdown_vm     = 1800 -> null
      - timeout_start_vm        = 1800 -> null
      - timeout_stop_vm         = 300 -> null
      - vm_id                   = 9013 -> null
        # (2 unchanged attributes hidden)

      - agent {
          - enabled = false -> null
          - timeout = "15m" -> null
          - trim    = false -> null
          - type    = "virtio" -> null
        }

      - cpu {
          - cores        = 1 -> null
          - flags        = [] -> null
          - hotplugged   = 0 -> null
          - limit        = 0 -> null
          - numa         = false -> null
          - sockets      = 1 -> null
          - type         = "host" -> null
          - units        = 1024 -> null
            # (2 unchanged attributes hidden)
        }

      - disk {
          - aio               = "io_uring" -> null
          - backup            = true -> null
          - cache             = "writeback" -> null
          - datastore_id      = "zssd" -> null
          - discard           = "on" -> null
          - file_format       = "raw" -> null
          - file_id           = "local:iso/debian-13-generic-amd64.img" -> null
          - interface         = "scsi0" -> null
          - iothread          = false -> null
          - path_in_datastore = "vm-9013-disk-0" -> null
          - replicate         = true -> null
          - size              = 8 -> null
          - ssd               = true -> null
            # (2 unchanged attributes hidden)
        }

      - initialization {
          - datastore_id         = "zssd" -> null
          - interface            = "ide2" -> null
          - type                 = "nocloud" -> null
            # (4 unchanged attributes hidden)
        }

      - memory {
          - dedicated      = 1024 -> null
          - floating       = 1024 -> null
          - keep_hugepages = false -> null
          - shared         = 0 -> null
            # (1 unchanged attribute hidden)
        }

      - serial_device {
          - device = "socket" -> null
        }
    }

  # module.debian13.terraform_data.creation_date will be created
  + resource "terraform_data" "creation_date" {
      + id     = (known after apply)
      + input  = {
          + timestamp = (known after apply)
        }
      + output = (known after apply)
    }

  # module.ubuntu22.proxmox_virtual_environment_vm.vm_template will be destroyed
  # (because proxmox_virtual_environment_vm.vm_template is not in configuration)
  - resource "proxmox_virtual_environment_vm" "vm_template" {
      - acpi                    = true -> null
      - bios                    = "seabios" -> null
      - id                      = "8022" -> null
      - ipv4_addresses          = [] -> null
      - ipv6_addresses          = [] -> null
      - keyboard_layout         = "en-us" -> null
      - mac_addresses           = [] -> null
      - machine                 = "q35" -> null
      - migrate                 = false -> null
      - name                    = "ubuntu22" -> null
      - network_interface_names = [] -> null
      - node_name               = "pve1" -> null
      - on_boot                 = true -> null
      - protection              = false -> null
      - reboot                  = false -> null
      - reboot_after_update     = true -> null
      - scsi_hardware           = "virtio-scsi-pci" -> null
      - stop_on_destroy         = false -> null
      - tablet_device           = true -> null
      - tags                    = [
          - "template",
          - "terraform",
          - "ubuntu",
        ] -> null
      - template                = true -> null
      - timeout_clone           = 1800 -> null
      - timeout_create          = 1800 -> null
      - timeout_migrate         = 1800 -> null
      - timeout_move_disk       = 1800 -> null
      - timeout_reboot          = 1800 -> null
      - timeout_shutdown_vm     = 1800 -> null
      - timeout_start_vm        = 1800 -> null
      - timeout_stop_vm         = 300 -> null
      - vm_id                   = 8022 -> null
        # (2 unchanged attributes hidden)

      - agent {
          - enabled = false -> null
          - timeout = "15m" -> null
          - trim    = false -> null
          - type    = "virtio" -> null
        }

      - cpu {
          - cores        = 1 -> null
          - flags        = [] -> null
          - hotplugged   = 0 -> null
          - limit        = 0 -> null
          - numa         = false -> null
          - sockets      = 1 -> null
          - type         = "host" -> null
          - units        = 1024 -> null
            # (2 unchanged attributes hidden)
        }

      - disk {
          - aio               = "io_uring" -> null
          - backup            = true -> null
          - cache             = "writeback" -> null
          - datastore_id      = "zssd" -> null
          - discard           = "on" -> null
          - file_format       = "raw" -> null
          - file_id           = "local:iso/ubuntu-22.04-server-cloudimg-amd64.img" -> null
          - interface         = "scsi0" -> null
          - iothread          = false -> null
          - path_in_datastore = "vm-8022-disk-0" -> null
          - replicate         = true -> null
          - size              = 8 -> null
          - ssd               = true -> null
            # (2 unchanged attributes hidden)
        }

      - initialization {
          - datastore_id         = "zssd" -> null
          - interface            = "ide2" -> null
          - type                 = "nocloud" -> null
            # (4 unchanged attributes hidden)
        }

      - memory {
          - dedicated      = 1024 -> null
          - floating       = 1024 -> null
          - keep_hugepages = false -> null
          - shared         = 0 -> null
            # (1 unchanged attribute hidden)
        }

      - serial_device {
          - device = "socket" -> null
        }
    }

  # module.ubuntu22.terraform_data.creation_date will be created
  + resource "terraform_data" "creation_date" {
      + id     = (known after apply)
      + input  = {
          + timestamp = (known after apply)
        }
      + output = (known after apply)
    }

  # module.debian13.module.cloud_init_files.random_id.random_id will be destroyed
  # (because module.debian13.module.cloud_init_files is not in configuration)
  - resource "random_id" "random_id" {
      - b64_std     = "8+pQ/fyYW88=" -> null
      - b64_url     = "8-pQ_fyYW88" -> null
      - byte_length = 8 -> null
      - dec         = "17575949547561573327" -> null
      - hex         = "f3ea50fdfc985bcf" -> null
      - id          = "8-pQ_fyYW88" -> null
      - keepers     = {
          - "combined_ci_hash"                    = "9af15b"
          - "short_ci_meta_data_contents_hash"    = "0"
          - "short_ci_network_data_contents_hash" = "0"
          - "short_ci_user_data_contents_hash"    = "0"
          - "short_ci_vendor_data_contents_hash"  = "0"
        } -> null
    }

  # module.ubuntu22.module.cloud_init_files.random_id.random_id will be destroyed
  # (because module.ubuntu22.module.cloud_init_files is not in configuration)
  - resource "random_id" "random_id" {
      - b64_std     = "h5l+VbXbboM=" -> null
      - b64_url     = "h5l-VbXbboM" -> null
      - byte_length = 8 -> null
      - dec         = "9770979773145378435" -> null
      - hex         = "87997e55b5db6e83" -> null
      - id          = "h5l-VbXbboM" -> null
      - keepers     = {
          - "combined_ci_hash"                    = "9af15b"
          - "short_ci_meta_data_contents_hash"    = "0"
          - "short_ci_network_data_contents_hash" = "0"
          - "short_ci_user_data_contents_hash"    = "0"
          - "short_ci_vendor_data_contents_hash"  = "0"
        } -> null
    }

Plan: 3 to add, 0 to change, 4 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-48-3eee8c84341b95e00d4d4dd1307a8268.tfplan -->
<!-- placeholder-6 -->